show:

Syntax: show ( A )

Description:

	Show takes a single argument and returns a brief description
	of the argument, it's class, name, and any other pertinent
	characteristics.

	Note that all the information provided by show() can be
	obtained by other means. class(), type(), and size(), as well
	as direct member reference will provide the same information
	as show.

	Examples:

	> m = rand(3,5)
	 m =
	 matrix columns 1 thru 5
	       0.368       0.766        0.78       0.625       0.917
	       0.983       0.646       0.823       0.315        0.52
	       0.535       0.767       0.152       0.347       0.401
	
	> show(m)
	   Name:      m
	   class:     matrix
	   type:       real
	     nr:       3
	     nc:       5

	> m.type
	real
	> m.class
	matrix
	> m.nr
	           3

See Also: class, size, type
